Revit 2024 API
BeforeExecutedEventArgs Members
The BeforeExecutedEventArgs type exposes the following members.
Methods
Name | Description
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
ActiveDocument
 The active document.
 (Inherited from CommandEventArgs.)
Cancel
 Indicates whether the event is being cancelled. When the event is cancellable, set the property to True to cancel it.
 (Inherited from RevitEventArgs.)
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
 (Inherited from RevitEventArgs.)
CommandId
 The command id.
 (Inherited from CommandEventArgs.)
UsingCommandData
 Indicates whether or not the Revit journal will include custom data populated by the application associated with this command.
See Also
BeforeExecutedEventArgs Class
Autodesk.Revit.UI.Events Namespace